Revit 2027 API
IndependentTag.GetLeaderStart Method
 Gets the free leader start point for the leader to the specified reference.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public XYZ GetLeaderStart(
	Reference referenceTagged
)
Public Function GetLeaderStart (
	referenceTagged As Reference
) As XYZ
public:
XYZ^ GetLeaderStart(
	Reference^ referenceTagged
)
member GetLeaderStart :
        referenceTagged : Reference -> XYZ
Parameters
referenceTagged Reference
 The reference which is tagged.
Return Value
XYZ
 A point representing the free start location for the leader.
Exceptions
Exception | Condition
ArgumentException |  There is no leader start because the tag does not use a free start leader or the leader is not visible. -or- The specified reference is not currently tagged.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The IndependentTag object does not have a tag behavior.
Remarks
 Tags without leaders or with leaders that use the attached leader start condition do not support free leader start points. LeaderStartCondition for the tag's leader start condition.
See Also
Reference
IndependentTag Class
Autodesk.Revit.DB Namespace